[Frost_Trooper X2SoldierClassTemplate]
+DisplayName="寒冰技工"
+ClassSummary="寒冰技工可以通过使用他们的小精灵来骚扰敌人，也能用狙击步枪来施加冰冻，削弱敌人，从而协助盟友。"
+LeftAbilityTreeTitle="Captain Cold"
+RightAbilityTreeTitle="Mr.Freeze"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="寒冰削弱"
AbilityTreeTitles[2]="小精灵们"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Chill"
+RandomNickNames[1]="Frosty"
+RandomNickNames[2]="Scout"
+RandomNickNames[3]="Iceberg"
+RandomNickNames[4]="Mr.Freeze"
+RandomNickNames[5]="Frozen"

[Fire_Trooper X2SoldierClassTemplate]
+DisplayName="纵火狂"
+ClassSummary="纵火狂对于火焰有着病态的追求。即使作为指挥官，当你试图亲近他们时也要小心他们手中的喷火器和颠佬的性格。在战场中，他们也可以在进行中短距离战斗使用带有燃烧属性的手枪进行攻击"
+LeftAbilityTreeTitle="Fire"
+RightAbilityTreeTitle="Flame"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="纵火颠佬"
AbilityTreeTitles[2]="警戒"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Fiery"
+RandomNickNames[1]="Dragon"
+RandomNickNames[2]="Wyvern"
+RandomNickNames[3]="Arsonist"
+RandomNickNames[4]="Pyro"
+RandomNickNames[5]="Wyrm"

[Bio_Trooper X2SoldierClassTemplate]
+DisplayName="纳垢守卫"
+ClassSummary="宣誓为纳垢与你效忠的士兵们会在战争过后充分利用敌人的尸体，他们更善于折磨那些已经百病缠身的敌人，或代替慈父向对方送去祝福。布拉德强烈要求它们中的任何人在面见你前至少洗三次澡。"
+LeftAbilityTreeTitle="Poison"
+RightAbilityTreeTitle="Stabbey"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="急性病毒"
AbilityTreeTitles[2]="致命药剂"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Plague Doctor"
+RandomNickNames[1]="Assassin"
+RandomNickNames[2]="Gallows"
+RandomNickNames[3]="Hangman"
+RandomNickNames[4]="Zero"
+RandomNickNames[5]="Iron Maiden"

[Acid_Trooper X2SoldierClassTemplate]
+DisplayName="绞肉机"
+ClassSummary="刀剑是好汉，子弹是笨蛋。绞肉机执着于近身作战，无论是使用他们的霰弹枪还是剑。它们坚信跳帮近战才是最正统的反抗军。事实上也的确如此，任何厚重的装甲在他们面前，都不过是一张对折过的纸。"
+LeftAbilityTreeTitle="Acid"
+RightAbilityTreeTitle="Sword"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="跳帮作战"
AbilityTreeTitles[2]="剑术大师"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Shredder"
+RandomNickNames[1]="Ooze"
+RandomNickNames[2]="Slime"
+RandomNickNames[3]="Blademaster"
+RandomNickNames[4]="Decay"
+RandomNickNames[5]="The End"

[Shock_Trooper X2SoldierClassTemplate]
+DisplayName="电工"
+ClassSummary="电工可以提供有效的火力压制，随身携带的电弧发射器能够让敌人感受‘左零右火’的快乐，面对战场上的铁王八时，电工们秘制的子弹是一切机甲的天然克星。不用担心用电剂量问题，这里有没有电，电工们一摸就知道。"
+LeftAbilityTreeTitle="Taser"
+RightAbilityTreeTitle="Shocker"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="火力压制"
AbilityTreeTitles[2]="用电安全"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Shocker"
+RandomNickNames[1]="Tazer"
+RandomNickNames[2]="Zapper"
+RandomNickNames[3]="Gunner"
+RandomNickNames[4]="Power"
+RandomNickNames[5]="Battery"

[Blast_Trooper X2SoldierClassTemplate]
+DisplayName="爆破手"
+ClassSummary="和纵火狂一样的颠佬，不炸点东西浑身难受，即使你收走了爆破手身上的所有火箭发射器、榴弹发射器或专用子弹，也要看看这群人口袋里有没有藏着几公斤白糖。沈曾经在一位爆破手身上搜出来十五公斤的炸药。"
+LeftAbilityTreeTitle="Blaster"
+RightAbilityTreeTitle="Rocketeer"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="BOOM！"
AbilityTreeTitles[2]="非线性导弹"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Boomer"
+RandomNickNames[1]="Demoman"
+RandomNickNames[2]="TNT"
+RandomNickNames[3]="Dynamite"
+RandomNickNames[4]="Wastelander"
+RandomNickNames[5]="Liberator"

[Psionic_Trooper X2SoldierClassTemplate]
+DisplayName="异端"
+ClassSummary="在训练灵能时，一些士兵通过某些并不愿透露给你的方式获得了黑魔法，异端们与亚空间签订的契约可以让其施展致命的法术，或者自愿付出代价来换取力量，只为帮你获得胜利。"
+LeftAbilityTreeTitle="Psi"
+RightAbilityTreeTitle="Mob"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="眠于阴影"
AbilityTreeTitles[2]="渴血症"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="Psycho"
+RandomNickNames[1]="Heretic"
+RandomNickNames[2]="Priest"
+RandomNickNames[3]="Demon"
+RandomNickNames[4]="Cultist"
+RandomNickNames[5]="Bishop"

[Slash_Trooper X2SoldierClassTemplate]
+DisplayName="盾卫"
+ClassSummary="盾卫是一种身材魁梧的士兵，盾牌张开时好似双开门冰箱，为你承受一切的伤害并将那些时刻关注着你的威胁目光吸引到自己身上。"
+LeftAbilityTreeTitle="Psi"
+RightAbilityTreeTitle="Mob"
AbilityTreeTitles[0]="花式射击"
AbilityTreeTitles[1]="孔武有力的双手"
AbilityTreeTitles[2]="扎实伟岸的肩膀"
AbilityTreeTitles[3]="XCOM"
AbilityTreeTitles[4]="手枪"

+RandomNickNames[0]="The Wall"
+RandomNickNames[1]="Captain"
+RandomNickNames[2]="Immovable"
+RandomNickNames[3]="Unbreakable"
+RandomNickNames[4]="Steadfast"
+RandomNickNames[5]="Stubborn"

